package parser

import (
	"testing"
	"github.com/antlr/antlr4/runtime/Go/antlr"
)

func walkerSubstituteWithStar(this *TreeShapeListener, ctx antlr.ParserRuleContext) {
	//fmt.Println(ctx.GetRuleIndex());
	//fmt.Println("****", ctx.GetText());

	//fmt.Println("walkerSubstituteWithStar >> ", ctx.GetText())
	switch ctx.GetRuleIndex() {
	case BibleParserRULE_reference:
		//fmt.Println(">", ctx.GetText(), "<")
		this.collector += "*"

	case BibleParserRULE_text:
		this.collector += ctx.GetText()
	}

	//
	//fmt.Println(ctx.GetRuleIndex(), ctx.GetText());
	//fmt.Printf("-> %T\n", this.errorListener);
	//if this.errorListener.InErrorMode {
	//
	//} else {
	//	switch ctx.GetRuleIndex() {
	//	case BibleParserRULE_reference:
	//		this.collector += "*"
	//
	//	case BibleParserRULE_text:
	//		this.collector += ctx.GetText()
	//	}
	//}
}

func walkerSubstituteWithReference(this *TreeShapeListener, ctx antlr.ParserRuleContext) {
	switch ctx.GetRuleIndex() {
	case BibleParserRULE_reference:

		this.collector += "~"

	case BibleParserRULE_text:
		this.collector += ctx.GetText()
	}
}

func TestParsing(t *testing.T) {
	var references = map[string]string{
		"Ин. 5:1":                                                                             "*",
		"Быт. 39:6—12":                                                                        "*",
		"1 Ин. 4:18, 19":                                                                      "*",
		"Ис. Нав. 3:9—17":                                                                     "*",
		"Ин. 9:2, 3":                                                                          "*",
		"1 Цар. 15:2, 8, 9":                                                                   "*",
		"Быт. 6:4,5,6,10-13":                                                                  "*",
		"Быт. 6:4":                                                                            "*",
		"1 Цар. 3:4,5,7-11":                                                                   "*",
		"Чис. 13:26-34; 14:1-2":                                                               "*",
		"Иов 38 ; 42:5, 6;":                                                                   "*;",
		"3 Цар. 17 ; Иов 38 ; 42:5, 6; Лк. 4:24–28 ; Евр. 11:1 ; Откр. 1:17 .":                "* ; *; * ; * ; * .",
		"Прочтите 1Цар.16:7; Матф.7:1 и 1Кор.4:5.":                                            "Прочтите *; * и *.",
		"Иуд. 3,5":                                                                            "*",
		"Что общего между 3 Цар. 17:3, 4 и 17:8, 9?":                                          "Что общего между *?",
		"4:24-1":                                                                              "4:24-1",
		"басни (см. 2 Петр. 1:16), но содержит ":                                              "басни (см. *), но содержит ",
		"2 Цар. 15–18":                                                                        "*",
		"Отрывок, записанный во 2 Цар. 15,18":                                                 "Отрывок, записанный во *",
		"Отрывок, записанный во 2 Цар. 15–18":                                                 "Отрывок, записанный во *",
		"Иуд. 3,5 не Иуды 4—16 прокол":                                                        "* не * прокол",
		"Почему 1 Цар. 3:4,5,7-11 не соответствует.":                                          "Почему * не соответствует.",
		"Прочитайте Быт. 6:4,5,6,10-13 и ответье на вопрос.":                                  "Прочитайте * и ответье на вопрос.",
		"Быт. 6:4; 7:9":                                                                       "*",
		", что слепота была следствием греха человека или его родителей (Ин. 9:2, 3). Должны": ", что слепота была следствием греха человека или его родителей (*). Должны",
		"Ис. Нав. 3:9—17;":                                                                    "*;",
		"1Кор.1:18-2:2":                                                                       "*",
		"Деян.23:1-6;25:23-26:29":                                                             "*",
		"Деян.23:6-1":                                                                         "*-1",
		"Деян.23:6-24:1":                                                                      "*",
		"нашуго Авв.2-3 текста":                                                               "нашуго * текста",
		"нашуго Авв.2 - 3 текста":                                                             "нашуго * - 3 текста",
	}

	for input, expecting := range references {
		text := SubstituteBibleRefWithStar(input)

		if text != expecting {
			t.Fatalf("%q is not recognized as a reference.\nGot\n\t%q\ninstead of\n\t%q", input, text, expecting)
		}
	}
}

func TestTexts(t *testing.T) {
	var texts = map[string]string{
		"Иуд. cc":    "Иуд. cc",
		"Иуд. 7":     "{51 [{1:7}]}",
		"Иуд. 7,9":   "{51 [{1:7} {1:9}]}",
		"Иуд. 7-9":   "{51 [{1:7 1:9}]}",
		"Иуд. 1,7-9": "{51 [{1:1} {1:7 1:9}]}",

		"Неем.3:6":         "{16 [{3:6}]}",
		"Неем.3:6,8,19-20": "{16 [{3:6} {3:8} {3:19 3:20}]}",
		"Евр.9:14-18":      "{65 [{9:14 9:18}]}",
		"1 Цар.23:6-1":     "{9 [{23:6}]}-1",
		"Евр.9:14-10:8":    "{65 [{9:14 9:28} {10:1 10:8}]}",

		"1 Пет.1":                                                                             "{46 [{1:1 1:25}]}",
		"1 Пет.1-2":                                                                           "{46 [{1:1 1:25} {2:1 2:25}]}",
		"1 Пет.1-3":                                                                           "{46 [{1:1 1:25} {2:1 2:25} {3:1 3:22}]}",
		"Деян.23:1-6;25:23-26:29":                                                             "{44 [{23:1 23:6} ; {25:23 25:27} {26:1 26:29}]}",
		"1Кор.1:18-2:2":                                                                       "{53 [{1:18 1:31} {2:1 2:2}]}",
		"1Кор.1:18-3:2":                                                                       "{53 [{1:18 1:31} {2:1 2:16} {3:1 3:2}]}",
		"Прочтите 1Цар.16:7; Матф.7:1 и 1Кор.4:5.":                                            "Прочтите {9 [{16:7}]}; {40 [{7:1}]} и {53 [{4:5}]}.",
		"3 Цар. 17 ; Иов 38 ; 42:5, 6; Лк. 4:24–28 ; Евр. 11:1 ; Откр. 1:17 .":                "{11 [{17:1 17:24}]} ; {18 [{38:1 38:41}  ;  {42:5} {42:6}]}; {42 [{4:24 4:28}]} ; {65 [{11:1}]} ; {66 [{1:17}]} .",
		"Что общего между 3 Цар. 17:3, 4 и 17:8, 9?":                                          "Что общего между {11 [{17:3} {17:4}  и  {17:8} {17:9}]}?",
		"басни (см. 2 Петр. 1:16), но содержит ":                                              "басни (см. {47 [{1:16}]}), но содержит ",
		"Чис. 13:26-34; 14:1-2":                                                               "{4 [{13:26 13:34} ;  {14:1 14:2}]}",
		"Иов 38 ; 42:5, 6;":                                                                   "{18 [{38:1 38:41}  ;  {42:5} {42:6}]};",
		"Отрывок, записанный во 2 Цар. 15,18":                                                 "Отрывок, записанный во {10 [{15:1 15:37} , {18:1 18:33}]}",
		"Иуд. 3,5 не Иуды 4—16 прокол":                                                        "{51 [{1:3} {1:5}]} не {51 [{1:4 1:16}]} прокол",
		"Почему 1 Цар. 3:4,5,7-11 не соответствует.":                                          "Почему {9 [{3:4} {3:5} {3:7 3:11}]} не соответствует.",
		"Быт. 6:4; 7:9":                                                                       "{1 [{6:4} ;  {7:9}]}",
		"Прочитайте Быт. 6:4,5,6,10-13 и ответье на вопрос.":                                  "Прочитайте {1 [{6:4} {6:5} {6:6} {6:10 6:13}]} и ответье на вопрос.",
		"1 Цар. 15:2, 8, 9":                                                                   "{9 [{15:2} {15:8} {15:9}]}",
		", что слепота была следствием греха человека или его родителей (Ин. 9:2, 3). Должны": ", что слепота была следствием греха человека или его родителей ({43 [{9:2} {9:3}]}). Должны",
		"Ис. Нав. 3:9—17;":                                                                    "{6 [{3:9 3:17}]};",
		"1 Ин. 4:18, 19":                                                                      "{48 [{4:18} {4:19}]}",
		"Быт. 39:6—12":                                                                        "{1 [{39:6 39:12}]}",
	}

	for text, expecting := range texts {
		got := SubstituteBibleRefWithXml(text)
		if expecting != got {
			t.Fatalf("%q is recognized as a reference.\nGot %q instead of %q", text, got, expecting)
		}
	}
}
